In [6]:
import numpy as np, pandas as pd

In [7]:

df={"first_name":["jason","Molly","Tina","Jake","Amy"],
   "Last_name":["Miller","Jacobson",".","Milner","Cooze"],
   "Age":[42,52,36,24,73],
   "preTestScore":[4,24,31,".",","],
   "postTestScore":["25000","94000",57,62,70]}

In [12]:
df=pd.DataFrame.from_dict(df)

In [13]:
df.to_csv("project.csv")

In [20]:
df_new=pd.read_csv("project.csv",index_col=0,header=None)

In [21]:
df_new

              1          2    3             4              5
0
NaN  first_name  Last_name  Age  preTestScore  postTestScore
0.0       jason     Miller   42             4          25000
1.0       Molly   Jacobson   52            24          94000
2.0        Tina          .   36            31             57
3.0        Jake     Milner   24             .             62
4.0         Amy      Cooze   73             ,             70

In [22]:
df = pd.read_csv('project.csv', index_col=['First Name', 'Last Name'], names=['UID', 'First Name', 'Last Name', 'Age', 'Pre-Test Score', 'Post-Test Score'])

In [23]:
df

                      UID  Age Pre-Test Score Post-Test Score
First Name Last Name
first_name Last_name  NaN  Age   preTestScore   postTestScore
jason      Miller     0.0   42              4           25000
Molly      Jacobson   1.0   52             24           94000
Tina       .          2.0   36             31              57
Jake       Milner     3.0   24              .              62
Amy        Cooze      4.0   73              ,              70

In [24]:
df = pd.read_csv('project.csv', na_values=['.'])
print(pd.isnull(df))

   Unnamed: 0  first_name  Last_name    Age  preTestScore  postTestScore
0       False       False      False  False         False          False
1       False       False      False  False         False          False
2       False       False       True  False         False          False
3       False       False      False  False          True          False
4       False       False      False  False         False          False

In [25]:
df = pd.read_csv('project.csv', skiprows=3)

In [27]:
print(df)

   2  Tina       .  36 31  57
0  3  Jake  Milner  24  .  62
1  4   Amy   Cooze  73  ,  70